meshGenTesting/AxiBase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 1);

boundaryField
{
    wall
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 1);
    }

    outlet 
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 1);
        value           uniform (0 0 1);
    }

    front
    {
	type		wedge;
    }

    back
    {
	type		wedge;
    }

    axis
    {
	type		empty;
    }

}

// ************************************************************************* //
