meshGenTesting/AxiBase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       1255;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       1275;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       1295;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          125;
        startFace       1395;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          125;
        startFace       1520;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       1645;
    }
)

// ************************************************************************* //
