meshGenTesting/AxiBase/system/blockMeshDict
// Generated by Chase Holder 

// D = 1.00
// L = 5.00
// theta = 1/16 pi



FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    ( 0.00000000  0.00000000  0.00) // 0 
    ( 0.04900857  0.49759236  0.00) // 1 
    (-0.04900857  0.49759236  0.00) // 2 
    ( 0.00000000  0.00000000  5.00) // 3 
    ( 0.04900857  0.49759236  5.00) // 4 
    (-0.04900857  0.49759236  5.00) // 5 
);

blocks
(
   // block 0
   hex (0 0 1 2 3 3 4 5) (4 5 25) simpleGrading (1.000 1.000 1.000)

);


edges
(
   arc 1 2 ( 0.00000000  0.50000000  0.00000000) // 0 
   arc 4 5 ( 0.00000000  0.50000000  5.00000000) // 1 
);

boundary
(

   inlet
   {
      type patch;
      faces
      (
         (0 0 1 2)
         );
   }

   outlet
   {
      type patch;
      faces
      (
         (3 3 4 5)
         );
   }

   wall
   {
      type wall;
      faces
      (
         (1 2 4 5)
      );
   }

   back
   {
      type wedge;
      faces
      (
         (0 3 5 2)
      );
   }

   front
   {
      type wedge;
      faces
      (
         (0 3 4 1)
      );
   }

   axis
   {
      type empty;
      faces
      (
         (0 3 3 0)
      );
   }

);
